open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_gpio_lowerhalf.c
/****************************************************************************
 * chips/bk7258/
 * bk7258_gpio_lowerhalf.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * NuttX GPIO lower-half devices for the selected board's LED and button.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <syslog.h>

#include <nuttx/ioexpander/gpio.h>
#include <nuttx/mutex.h>
#include <nuttx/spinlock.h>

#include <arch/chip/bk7258_gpio.h>

#include <driver/gpio.h>
#include <driver/int.h>
#include <driver/int_types.h>

#include "bk7258_sdk_irq.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_GPIO_LED_MINOR               0
#define BK7258_GPIO_KEY_MINOR               1
#define BK7258_GPIO_SECURE_SOURCE           INT_SRC_GPIO
#define BK7258_GPIO_ROUTE_REG               0x44010084u
#define BK7258_GPIO_SECURE_ROUTE_BIT        (1u << 23)
#define BK7258_GPIO_ROUTE_MASK              BK7258_GPIO_SECURE_ROUTE_BIT

/****************************************************************************
 * Compile-time Invariants
 ****************************************************************************/

_Static_assert(INT_SRC_GPIO == 55,
               "GPIO lower-half requires GPIO_S source 55");

extern void bk7258_gpio_cp_irq_enable(void);

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_gpio_output_s
{
  struct gpio_dev_s gpio;
  mutex_t lock;
  gpio_id_t pin;
  bool value;
};

struct bk7258_gpio_interrupt_s
{
  struct gpio_dev_s gpio;
  mutex_t lock;
  gpio_id_t pin;
  bool active_low;
  volatile pin_interrupt_t callback;
  uint32_t saved_route;
  bool enabled;
  bool route_gate_touched;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_gpio_output_read(FAR struct gpio_dev_s *dev,
                                   FAR bool *value);
static int bk7258_gpio_output_write(FAR struct gpio_dev_s *dev,
                                    bool value);
static int bk7258_gpio_output_setpintype(FAR struct gpio_dev_s *dev,
                                         enum gpio_pintype_e pintype);
static int bk7258_gpio_key_read(FAR struct gpio_dev_s *dev,
                                FAR bool *value);
static int bk7258_gpio_key_attach(FAR struct gpio_dev_s *dev,
                                  pin_interrupt_t callback);
static int bk7258_gpio_key_enable(FAR struct gpio_dev_s *dev, bool enable);
static int bk7258_gpio_key_setpintype(FAR struct gpio_dev_s *dev,
                                      enum gpio_pintype_e pintype);
static int bk7258_gpio_setdebounce(FAR struct gpio_dev_s *dev,
                                   unsigned long duration);
static int bk7258_gpio_output_setmask(FAR struct gpio_dev_s *dev,
                                      bool enable);
static int bk7258_gpio_key_setmask(FAR struct gpio_dev_s *dev, bool enable);
static bool bk7258_gpio_led_available(
  FAR const struct bk7258_gpio_config_s *config);
static int bk7258_gpio_validate_config(
  FAR const struct bk7258_gpio_config_s *config);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct gpio_operations_s g_bk7258_gpio_output_ops =
{
  .go_read        = bk7258_gpio_output_read,
  .go_write       = bk7258_gpio_output_write,
  .go_attach      = NULL,
  .go_enable      = NULL,
  .go_setpintype  = bk7258_gpio_output_setpintype,
  .go_setdebounce = bk7258_gpio_setdebounce,
  .go_setmask     = bk7258_gpio_output_setmask,
};

static const struct gpio_operations_s g_bk7258_gpio_key_ops =
{
  .go_read        = bk7258_gpio_key_read,
  .go_write       = NULL,
  .go_attach      = bk7258_gpio_key_attach,
  .go_enable      = bk7258_gpio_key_enable,
  .go_setpintype  = bk7258_gpio_key_setpintype,
  .go_setdebounce = bk7258_gpio_setdebounce,
  .go_setmask     = bk7258_gpio_key_setmask,
};

static const gpio_config_t g_bk7258_gpio_led_config =
{
  .io_mode = GPIO_OUTPUT_ENABLE,
  .pull_mode = GPIO_PULL_DISABLE,
  .func_mode = GPIO_SECOND_FUNC_DISABLE,
};

static gpio_config_t g_bk7258_gpio_key_config =
{
  .io_mode = GPIO_INPUT_ENABLE,
  .pull_mode = GPIO_PULL_DISABLE,
  .func_mode = GPIO_SECOND_FUNC_DISABLE,
};

/* These instances represent selected physical-board resources for the full
 * boot lifetime.  The key instance remains file-local so its SDK per-pin ISR
 * can dispatch without allocation or blocking in interrupt context.
 */

static struct bk7258_gpio_output_s g_bk7258_gpio_led =
{
  .gpio =
    {
      .gp_pintype = GPIO_OUTPUT_PIN,
      .gp_ops = &g_bk7258_gpio_output_ops,
    },
  .lock = NXMUTEX_INITIALIZER,
  .pin = GPIO_0,
};

static struct bk7258_gpio_interrupt_s g_bk7258_gpio_key =
{
  .gpio =
    {
      .gp_pintype = GPIO_INTERRUPT_FALLING_PIN,
      .gp_ops = &g_bk7258_gpio_key_ops,
    },
  .lock = NXMUTEX_INITIALIZER,
  .pin = GPIO_0,
};

static mutex_t g_bk7258_gpio_init_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_gpio_initialized;
static bool g_bk7258_gpio_led_available;

/* The selected binding is copied into these instances during initialization;
 * keeping the local aliases preserves the existing devnode semantics while
 * avoiding board-config macros in the reusable chip source.
 */

#define BK7258_GPIO_LED_PIN  (g_bk7258_gpio_led.pin)
#define BK7258_GPIO_KEY_PIN  (g_bk7258_gpio_key.pin)

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool bk7258_gpio_led_available(
  FAR const struct bk7258_gpio_config_s *config)
{
#if defined(CONFIG_BK7258_UART1)
  if (config->user_led_console_shared)
    {
      return false;
    }
#endif

#if defined(CONFIG_BK7258_SWD_DEBUG) && \
    defined(CONFIG_BK7258_SWD_PINS_P0_P1)
  if (config->user_led_gpio == 0 || config->user_led_gpio == 1)
    {
      return false;
    }
#endif

