open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_gpio_lowerhalf.c
  return true;
}

static int bk7258_gpio_validate_config(
  FAR const struct bk7258_gpio_config_s *config)
{
  if (config == NULL || config->name == NULL)
    {
      return -ENODEV;
    }

  if (config->user_led_gpio >= GPIO_NUM ||
      config->user_button_gpio >= GPIO_NUM ||
      config->user_led_gpio == config->user_button_gpio)
    {
      return -EINVAL;
    }

  return OK;
}

static int bk7258_gpio_result(bk_err_t error)
{
  if (error == BK_OK)
    {
      return OK;
    }

  if (error == BK_ERR_GPIO_INTERNAL_USED)
    {
      return -EBUSY;
    }

  return -EIO;
}

static uint32_t bk7258_gpio_enable_route(uint32_t *saved)
{
  volatile uint32_t *reg =
    (volatile uint32_t *)(uintptr_t)BK7258_GPIO_ROUTE_REG;
  irqstate_t flags;
  uint32_t value;

  flags = enter_critical_section();
  *saved = *reg;
  *reg = *saved | BK7258_GPIO_ROUTE_MASK;
  value = *reg;
  leave_critical_section(flags);
  return value;
}

static uint32_t bk7258_gpio_restore_route(uint32_t saved)
{
  volatile uint32_t *reg =
    (volatile uint32_t *)(uintptr_t)BK7258_GPIO_ROUTE_REG;
  irqstate_t flags;
  uint32_t value;

  flags = enter_critical_section();
  value = *reg;
  value &= ~BK7258_GPIO_ROUTE_MASK;
  value |= saved & BK7258_GPIO_ROUTE_MASK;
  *reg = value;
  value = *reg;
  leave_critical_section(flags);
  return value;
}

static int bk7258_gpio_close_route(
  FAR struct bk7258_gpio_interrupt_s *key)
{
  uint32_t value;

  if (key->route_gate_touched)
    {
      value = bk7258_gpio_restore_route(key->saved_route);
      if ((value & BK7258_GPIO_ROUTE_MASK) !=
          (key->saved_route & BK7258_GPIO_ROUTE_MASK))
        {
          /* Keep source37 installed while the route might still be live. */

          return -EIO;
        }

      key->route_gate_touched = false;
    }

  return OK;
}

static int bk7258_gpio_open_route(
  FAR struct bk7258_gpio_interrupt_s *key)
{
  int_group_isr_t secure_handler = NULL;
  uint32_t value;
  bk_err_t error;
  int result;

  if (key->route_gate_touched)
    {
      result = bk7258_gpio_close_route(key);
      if (result < 0)
        {
          return result;
        }
    }

  /* Enable GPIO interrupt forwarding to CPU0 at the system level.
   * The CP SDK only calls this from the low-power entry path, never from
   * normal GPIO init.  Without it, GPIO pending bits never reach the NVIC.
   */

  bk7258_gpio_cp_irq_enable();

  error = bk7258_sdk_irq_snapshot_handler(BK7258_GPIO_SECURE_SOURCE,
                                           &secure_handler);
  if (error != BK_OK || secure_handler == NULL)
    {
      syslog(LOG_ERR,
             "bk7258 gpio: snapshot source=%u SDK error=%d handler=%p\n",
             (unsigned int)BK7258_GPIO_SECURE_SOURCE, (int)error,
             (FAR void *)(uintptr_t)secure_handler);
      return -EIO;
    }

  value = bk7258_gpio_enable_route(&key->saved_route);
  key->route_gate_touched = true;
  if ((value & BK7258_GPIO_ROUTE_MASK) != BK7258_GPIO_ROUTE_MASK)
    {
      syslog(LOG_ERR,
             "bk7258 gpio: route readback saved=0x%08lx value=0x%08lx "
             "mask=0x%08lx\n",
             (unsigned long)key->saved_route, (unsigned long)value,
             (unsigned long)BK7258_GPIO_ROUTE_MASK);
      (void)bk7258_gpio_close_route(key);
      return -EIO;
    }

  return OK;
}

static int bk7258_gpio_key_interrupt_type(
  enum gpio_pintype_e pintype, bool active_low,
  FAR gpio_int_type_t *type)
{
  switch (pintype)
    {
      case GPIO_INTERRUPT_PIN:
        *type = active_low ? GPIO_INT_TYPE_FALLING_EDGE :
                             GPIO_INT_TYPE_RISING_EDGE;
        return OK;

      case GPIO_INTERRUPT_FALLING_PIN:
        *type = GPIO_INT_TYPE_FALLING_EDGE;
        return OK;

      case GPIO_INTERRUPT_RISING_PIN:
        *type = GPIO_INT_TYPE_RISING_EDGE;
        return OK;

      default:
        return -ENOTSUP;
    }
}

/* This is the pinned SDK per-pin callback, not the hardware NVIC handler.
 * The SDK top-level ISR has already cleared the selected key pin before
 * invoking it.
 */

static void bk7258_gpio_key_isr(gpio_id_t gpio_id)
{
  pin_interrupt_t callback;

  if (gpio_id != g_bk7258_gpio_key.pin)
    {
      return;
    }

  callback = g_bk7258_gpio_key.callback;
  if (callback != NULL)
    {
      callback(&g_bk7258_gpio_key.gpio, (uint8_t)gpio_id);
    }
}

static int bk7258_gpio_output_read(FAR struct gpio_dev_s *dev,
                                   FAR bool *value)
{
  FAR struct bk7258_gpio_output_s *output =
    (FAR struct bk7258_gpio_output_s *)dev;
  int result;

  if (output == NULL || value == NULL)
    {
      return -EINVAL;
    }

  result = nxmutex_lock(&output->lock);
  if (result < 0)
    {
      return result;
    }

  *value = output->value;
  nxmutex_unlock(&output->lock);
  return OK;
}

static int bk7258_gpio_output_write(FAR struct gpio_dev_s *dev,
                                    bool value)
{
  FAR struct bk7258_gpio_output_s *output =
    (FAR struct bk7258_gpio_output_s *)dev;
  bk_err_t error;
  int result;

  if (output == NULL)
    {
      return -EINVAL;
    }

  result = nxmutex_lock(&output->lock);
  if (result < 0)
    {
      return result;
    }

  error = value ? bk_gpio_set_output_high(output->pin) :
                  bk_gpio_set_output_low(output->pin);
  result = bk7258_gpio_result(error);
  if (result == OK)
    {
      output->value = value;
    }

  nxmutex_unlock(&output->lock);
  return result;
}

static int bk7258_gpio_output_setpintype(FAR struct gpio_dev_s *dev,
                                         enum gpio_pintype_e pintype)
{
  FAR struct bk7258_gpio_output_s *output =
    (FAR struct bk7258_gpio_output_s *)dev;
  bk_err_t error;
  int result;

  if (output == NULL || pintype != GPIO_OUTPUT_PIN)
    {
      return -ENOTSUP;
    }

  result = nxmutex_lock(&output->lock);
  if (result < 0)
    {
      return result;
    }

  result = bk7258_gpio_result(
             bk_gpio_set_config(output->pin, &g_bk7258_gpio_led_config));
  if (result == OK)
    {
      error = output->value ? bk_gpio_set_output_high(output->pin) :
                              bk_gpio_set_output_low(output->pin);
      result = bk7258_gpio_result(error);
      if (result == OK)
        {
          output->gpio.gp_pintype = GPIO_OUTPUT_PIN;
        }
    }

  nxmutex_unlock(&output->lock);
  return result;
}

static int bk7258_gpio_key_read(FAR struct gpio_dev_s *dev,
                                FAR bool *value)
{
  FAR struct bk7258_gpio_interrupt_s *key =
    (FAR struct bk7258_gpio_interrupt_s *)dev;
  int result;

  if (key == NULL || value == NULL)
    {
      return -EINVAL;
    }

  result = nxmutex_lock(&key->lock);
  if (result < 0)
    {
      return result;
    }

  *value = bk_gpio_get_input(key->pin);
  nxmutex_unlock(&key->lock);
  return OK;
}

