open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_gpio_lowerhalf.c
static int bk7258_gpio_key_attach(FAR struct gpio_dev_s *dev,
                                  pin_interrupt_t callback)
{
  FAR struct bk7258_gpio_interrupt_s *key =
    (FAR struct bk7258_gpio_interrupt_s *)dev;
  gpio_isr_t isr;
  bk_err_t error;
  int result;

  if (key == NULL)
    {
      return -EINVAL;
    }

  result = nxmutex_lock(&key->lock);
  if (result < 0)
    {
      return result;
    }

  if (key->enabled)
    {
      nxmutex_unlock(&key->lock);
      return -EBUSY;
    }

  isr = callback != NULL ? bk7258_gpio_key_isr : NULL;
  error = bk_gpio_register_isr(key->pin, isr);
  result = bk7258_gpio_result(error);
  if (result < 0)
    {
      syslog(LOG_ERR,
             "bk7258 gpio: attach P%u callback=%p SDK error=%d\n",
             (unsigned int)key->pin,
             (FAR void *)(uintptr_t)callback, (int)error);
    }

  if (result == OK)
    {
      key->callback = callback;
    }

  nxmutex_unlock(&key->lock);
  return result;
}

static int bk7258_gpio_key_enable(FAR struct gpio_dev_s *dev, bool enable)
{
  FAR struct bk7258_gpio_interrupt_s *key =
    (FAR struct bk7258_gpio_interrupt_s *)dev;
  gpio_int_type_t type;
  bk_err_t error;
  int cleanup_result;
  int result;

  if (key == NULL)
    {
      return -EINVAL;
    }

  result = nxmutex_lock(&key->lock);
  if (result < 0)
    {
      return result;
    }

  if (enable && key->enabled)
    {
      nxmutex_unlock(&key->lock);
      return OK;
    }

  if (!enable)
    {
      result = bk7258_gpio_result(bk_gpio_disable_interrupt(key->pin));
      error = bk_gpio_clear_interrupt(key->pin);
      if (error != BK_OK)
        {
          result = -EIO;
        }

      cleanup_result = bk7258_gpio_close_route(key);
      if (result == OK)
        {
          result = cleanup_result;
        }

      key->enabled = false;
      nxmutex_unlock(&key->lock);
      return result;
    }

  if (key->callback == NULL)
    {
      nxmutex_unlock(&key->lock);
      return -EINVAL;
    }

  /* AP-side SDK drivers initialize their own default GPIO table after the
   * CP lower-half has been registered.  In the v3.1.1.9 BK7258 AP table,
   * P12 is reset to a disabled secondary-function entry.  Reassert the
   * board-owned key configuration at the point the NuttX client enables the
   * interrupt so the standard GPIO ABI does not depend on AP startup order.
   */

  result = bk7258_gpio_result(
             bk_gpio_set_config(key->pin, &g_bk7258_gpio_key_config));
  if (result < 0)
    {
      syslog(LOG_ERR, "bk7258 gpio: configure key P%u failed=%d\n",
             (unsigned int)key->pin, result);
      nxmutex_unlock(&key->lock);
      return result;
    }

  result = bk7258_gpio_key_interrupt_type(
             (enum gpio_pintype_e)key->gpio.gp_pintype,
             key->active_low, &type);
  if (result < 0)
    {
      nxmutex_unlock(&key->lock);
      return result;
    }

  result = bk7258_gpio_result(
             bk_gpio_set_interrupt_type(key->pin, type));
  if (result < 0)
    {
      syslog(LOG_ERR,
             "bk7258 gpio: set interrupt type P%u type=%u failed=%d\n",
             (unsigned int)key->pin, (unsigned int)type, result);
      nxmutex_unlock(&key->lock);
      return result;
    }

  result = bk7258_gpio_result(bk_gpio_clear_interrupt(key->pin));
  if (result < 0)
    {
      syslog(LOG_ERR, "bk7258 gpio: clear P%u failed=%d\n",
             (unsigned int)key->pin, result);
      nxmutex_unlock(&key->lock);
      return result;
    }

  /* Register the SDK per-pin callback.  This is what the SDK's gpio_isr
   * uses to deliver the interrupt to our handler.
   */

  result = bk7258_gpio_result(
             bk_gpio_register_isr(key->pin, bk7258_gpio_key_isr));
  if (result < 0)
    {
      syslog(LOG_ERR, "bk7258 gpio: register ISR P%u failed=%d\n",
             (unsigned int)key->pin, result);
      nxmutex_unlock(&key->lock);
      return result;
    }

  result = bk7258_gpio_open_route(key);
  if (result < 0)
    {
      syslog(LOG_ERR,
             "bk7258 gpio: open route P%u reg=0x%08lx failed=%d\n",
             (unsigned int)key->pin,
             (unsigned long)BK7258_GPIO_ROUTE_REG, result);
      (void)bk_gpio_register_isr(key->pin, NULL);
      nxmutex_unlock(&key->lock);
      return result;
    }

  result = bk7258_gpio_result(bk_gpio_enable_interrupt(key->pin));
  if (result < 0)
    {
      syslog(LOG_ERR, "bk7258 gpio: enable P%u failed=%d\n",
             (unsigned int)key->pin, result);
      cleanup_result = bk7258_gpio_close_route(key);
      if (cleanup_result < 0)
        {
          result = cleanup_result;
        }

      nxmutex_unlock(&key->lock);
      return result;
    }

  key->enabled = true;
  nxmutex_unlock(&key->lock);
  return OK;
}

static int bk7258_gpio_key_setpintype(FAR struct gpio_dev_s *dev,
                                      enum gpio_pintype_e pintype)
{
  FAR struct bk7258_gpio_interrupt_s *key =
    (FAR struct bk7258_gpio_interrupt_s *)dev;
  gpio_int_type_t type;
  int result;

  if (key == NULL)
    {
      return -EINVAL;
    }

  switch (pintype)
    {
      case GPIO_INPUT_PIN_PULLUP:
      case GPIO_INTERRUPT_PIN:
      case GPIO_INTERRUPT_RISING_PIN:
      case GPIO_INTERRUPT_FALLING_PIN:
        break;

      default:
        return -ENOTSUP;
    }

  result = nxmutex_lock(&key->lock);
  if (result < 0)
    {
      return result;
    }

  if (key->enabled || key->callback != NULL)
    {
      nxmutex_unlock(&key->lock);
      return -EBUSY;
    }

  result = bk7258_gpio_result(
             bk_gpio_set_config(key->pin, &g_bk7258_gpio_key_config));
  if (result < 0)
    {
      nxmutex_unlock(&key->lock);
      return result;
    }

  if (pintype >= GPIO_INTERRUPT_PIN)
    {
      result = bk7258_gpio_key_interrupt_type(pintype, key->active_low,
                                              &type);
      if (result == OK)
        {
          result = bk7258_gpio_result(
                     bk_gpio_set_interrupt_type(key->pin, type));
        }
    }

  if (result == OK)
    {
      key->gpio.gp_pintype = pintype;
    }

  nxmutex_unlock(&key->lock);
  return result;
}

