open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_gpio_lowerhalf.c
static int bk7258_gpio_setdebounce(FAR struct gpio_dev_s *dev,
                                   unsigned long duration)
{
  (void)dev;
  (void)duration;
  return -ENOTSUP;
}

static int bk7258_gpio_output_setmask(FAR struct gpio_dev_s *dev,
                                      bool enable)
{
  (void)dev;
  (void)enable;
  return -ENOTSUP;
}

static int bk7258_gpio_key_setmask(FAR struct gpio_dev_s *dev, bool enable)
{
  return bk7258_gpio_key_enable(dev, !enable);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_gpio_lowerhalf_initialize
 *
 * Description:
 *   Configure and register the selected physical board's LED and user-key
 *   devices as /dev/gpio0 and /dev/gpio1.  A board whose LED is claimed by
 *   UART1 or the active P0/P1 SWD route omits /dev/gpio0 without touching
 *   that pin, while keeping the independent user-key device available as
 *   /dev/gpio1.
 *
 * Returned Value:
 *   Zero on success or a negated errno value on failure.
 *
 ****************************************************************************/

int bk7258_gpio_lowerhalf_initialize(
  FAR const struct bk7258_gpio_config_s *config)
{
  uint32_t saved_led = 0;
  uint32_t saved_key;
  bool led_configured = false;
  bool key_configured = false;
  bool led_registered = false;
  bk_err_t error;
  int result;

  result = nxmutex_lock(&g_bk7258_gpio_init_lock);
  if (result < 0)
    {
      return result;
    }

  if (g_bk7258_gpio_initialized)
    {
      nxmutex_unlock(&g_bk7258_gpio_init_lock);
      return OK;
    }

  result = bk7258_gpio_validate_config(config);
  if (result < 0)
    {
      nxmutex_unlock(&g_bk7258_gpio_init_lock);
      return result;
    }

  g_bk7258_gpio_led.pin = (gpio_id_t)config->user_led_gpio;
  g_bk7258_gpio_key.pin = (gpio_id_t)config->user_button_gpio;
  g_bk7258_gpio_key.active_low = config->user_button_active_low;
  g_bk7258_gpio_key.gpio.gp_pintype =
    config->user_button_active_low ? GPIO_INTERRUPT_FALLING_PIN :
                                     GPIO_INTERRUPT_RISING_PIN;
  g_bk7258_gpio_key_config.pull_mode =
    config->user_button_active_low ? GPIO_PULL_UP_EN : GPIO_PULL_DOWN_EN;
  g_bk7258_gpio_led_available = bk7258_gpio_led_available(config);

  result = bk7258_gpio_result(bk_gpio_driver_init());
  if (result < 0)
    {
      goto out;
    }

  saved_key = bk_gpio_get_value(BK7258_GPIO_KEY_PIN);

  if (g_bk7258_gpio_led_available)
    {
      saved_led = bk_gpio_get_value(BK7258_GPIO_LED_PIN);
      result = bk7258_gpio_result(
                 bk_gpio_set_config(BK7258_GPIO_LED_PIN,
                                    &g_bk7258_gpio_led_config));
      if (result < 0)
        {
          goto out;
        }

      led_configured = true;
      error = !config->user_led_active_high ?
                bk_gpio_set_output_high(BK7258_GPIO_LED_PIN) :
                bk_gpio_set_output_low(BK7258_GPIO_LED_PIN);
      result = bk7258_gpio_result(error);
      if (result < 0)
        {
          goto restore;
        }

      g_bk7258_gpio_led.value = !config->user_led_active_high;
    }

  result = bk7258_gpio_result(
             bk_gpio_set_config(BK7258_GPIO_KEY_PIN,
                                &g_bk7258_gpio_key_config));
  if (result < 0)
    {
      goto restore;
    }

  key_configured = true;
  result = bk7258_gpio_result(
             bk_gpio_disable_interrupt(BK7258_GPIO_KEY_PIN));
  if (result < 0)
    {
      goto restore;
    }

  result = bk7258_gpio_result(
             bk_gpio_clear_interrupt(BK7258_GPIO_KEY_PIN));
  if (result < 0)
    {
      goto restore;
    }

  if (g_bk7258_gpio_led_available)
    {
      result = gpio_pin_register(&g_bk7258_gpio_led.gpio,
                                 BK7258_GPIO_LED_MINOR);
      if (result < 0)
        {
          goto restore;
        }

      led_registered = true;
    }

  result = gpio_pin_register(&g_bk7258_gpio_key.gpio,
                             BK7258_GPIO_KEY_MINOR);
  if (result < 0)
    {
      goto unregister;
    }

  g_bk7258_gpio_initialized = true;
  nxmutex_unlock(&g_bk7258_gpio_init_lock);
  return OK;

unregister:
  if (led_registered)
    {
      (void)gpio_pin_unregister(&g_bk7258_gpio_led.gpio,
                                BK7258_GPIO_LED_MINOR);
    }

restore:
  if (key_configured)
    {
      error = bk_gpio_set_value(BK7258_GPIO_KEY_PIN, saved_key);
      if (error != BK_OK)
        {
          result = -EIO;
        }
    }

  if (led_configured)
    {
      error = bk_gpio_set_value(BK7258_GPIO_LED_PIN, saved_led);
      if (error != BK_OK)
        {
          result = -EIO;
        }
    }

out:
  nxmutex_unlock(&g_bk7258_gpio_init_lock);
  return result;
}
